frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `created_at`, `updated_at`) VALUES ('test2', 'test@test.com', '$2y$13$GwDD2p/pek2umtaS2Q7gK.Fg1tkpS8MpjqtDIc3LzPMsdJJHBxF4a', '9KmAOViwZqDi6EHyxtRbow6UsswwpkAc', '3UNhsFdnV3ryqgbcsCq8HjVdc-IfVGhy_1605036590', 1605036590, 1605036590)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        //$user->save(false);
        //$auth = \Yii::$app->authManager;
        //$authorRole = $auth->getRole('client');
        //$auth->assign($authorRole, $user->getId());

        return $user->save() && $this->sendEmail($user);